gitpan/zxid/c/saml2-dec.c
#define EL_NAME   ac_AuthenticatorTransportProtocol
#define EL_STRUCT zx_ac_AuthenticatorTransportProtocol_s
#define EL_NS     ac
#define EL_TAG    AuthenticatorTransportProtocol

struct zx_ac_AuthenticatorTransportProtocol_s* zx_DEC_ac_AuthenticatorTransportProtocol(struct zx_ctx* c)
{
  int tok;
  struct zx_elem_s* el;
  struct zx_str_s* ss;
  struct zx_any_attr_s* attr;
  struct zx_any_elem_s* elem;
  char* name;
  char* data;
  char quote;
  struct zx_ac_AuthenticatorTransportProtocol_s* x = ZX_ZALLOC(c, struct zx_ac_AuthenticatorTransportProtocol_s);
  x->gg.g.tok = zx_ac_AuthenticatorTransportProtocol_ELEM;
  x->gg.g.ns = zx_elems[zx_ac_AuthenticatorTransportProtocol_ELEM].ns;
  ZX_START_DEC_EXT(x);

#if 1 /* NORMALMODE */
  x->gg.g.err |= ZXERR_TAG_NOT_CLOSED;

  /* The tag name has already been detected. Process attributes until '>' */
  
  for (; 1; ++c->p) {
    ZX_SKIP_WS(c,x);
    if (ONE_OF_2(*c->p, '>', '/'))
      break;
    name = c->p;
    ZX_LOOK_FOR(c,'=',x);
    
    ++c->p;
    if (!ONE_OF_2(*c->p, '"', '\''))
      return 0;
    quote = *c->p;
    ++c->p;
    data = c->p;	
    
    ZX_LOOK_FOR(c,quote,x);
    
    tok = zx_attr_lookup(c, name, data-2);
    switch (tok) {

    case ZX_TOK_XMLNS:
      ZX_XMLNS_DEC_EXT(ss);
      goto next_attr;
    default:
      D("known attribute(%.*s) tok(%d) in wrong context(%d)", c->p - name, name, tok, x->gg.g.tok);
      tok = ZX_TOK_NOT_FOUND;
      /* fall thru to classify it as anyAttr extension */
    case ZX_TOK_NOT_FOUND:
      attr = ZX_ZALLOC(c, struct zx_any_attr_s);
      attr->name_len = data - name - 2;
      attr->name = name;
      attr->ss.g.n = &x->gg.any_attr->ss.g;
      x->gg.any_attr = attr;
      ss = &attr->ss;
      /* *** namespace handling for unknown element? */
      ZX_UNKNOWN_ATTR_DEC_EXT(attr);
      goto set_attr_val;
    }
    ss->g.ns = zx_attrs[tok].ns;
set_attr_val:
    ss->g.tok = tok;
    ss->len = c->p - data;
    ss->s = data;
next_attr:
    continue;
  }
  ++c->p;
  if (c->p[-1] == '/' && c->p[0] == '>') {  /* Tag without content */
    ++c->p;
    x->gg.g.err &= ~ZXERR_TAG_NOT_CLOSED;
    ZX_END_DEC_EXT(x);
    return x;
  }
#endif

  /* Process contents until '</' */
  
  ZX_START_BODY_DEC_EXT(x);
  
  while (1) {
  next_elem:
    ZX_SKIP_WS(c,x);
    if (*c->p == '<') {
    potential_tag:
      ++c->p;
      switch (*c->p) {
      case '?':  /* processing instruction */
	ERR("Processing instructions not supported. %d",0);
	ZX_PI_DEC_EXT(pi);
	return 0;
      case '!':  /* comment */
	ERR("Comments not supported. %d",0);
	ZX_COMMENT_DEC_EXT(comment);
	return 0;
      case '/':  /* close tag */
	++c->p;
	name = c->p;
	ZX_LOOK_FOR(c,'>',x);
	tok = zx_elem_lookup(c, name, c->p);
	if (tok != x->gg.g.tok) {
	  ERR("Mismatching close tag(%.*s)", c->p-name, name);
	  x->gg.g.err |= ZXERR_MISMATCH_CLOSE;
	  ++c->p;
	  return x;
	}
	/* Legitimate close tag. Normal exit from this function. */
	++c->p;
	x->gg.g.err &= ~ZXERR_TAG_NOT_CLOSED;
	ZX_END_DEC_EXT(x);
	return x;
      default:
	if (A_Z_a_z_(*c->p)) {
	  name = c->p;
	  for (++c->p; *c->p && !ONE_OF_6(*c->p, ' ', '>', '/', '\n', '\r', '\t'); ++c->p) ;
	  if (!c->p)
	    return 0;
	  zx_scan_xmlns(c);  /* Prescan namespaces so that token can be correctly recognized. */
	  tok = zx_elem_lookup(c, name, c->p);
	  switch (tok) {
          case zx_ac_HTTP_ELEM:
            el = (struct zx_elem_s*)zx_DEC_ac_HTTP(c);
            el->g.n = &x->HTTP->gg.g;
            x->HTTP = (struct zx_ac_HTTP_s*)el;
            break;
          case zx_ac_SSL_ELEM:
            el = (struct zx_elem_s*)zx_DEC_ac_SSL(c);
            el->g.n = &x->SSL->gg.g;
            x->SSL = (struct zx_ac_SSL_s*)el;
            break;
          case zx_ac_MobileNetworkNoEncryption_ELEM:
            el = (struct zx_elem_s*)zx_DEC_ac_MobileNetworkNoEncryption(c);
            el->g.n = &x->MobileNetworkNoEncryption->gg.g;
            x->MobileNetworkNoEncryption = (struct zx_ac_MobileNetworkNoEncryption_s*)el;
            break;
          case zx_ac_MobileNetworkRadioEncryption_ELEM:
            el = (struct zx_elem_s*)zx_DEC_ac_MobileNetworkRadioEncryption(c);
            el->g.n = &x->MobileNetworkRadioEncryption->gg.g;
            x->MobileNetworkRadioEncryption = (struct zx_ac_MobileNetworkRadioEncryption_s*)el;
            break;
          case zx_ac_MobileNetworkEndToEndEncryption_ELEM:
            el = (struct zx_elem_s*)zx_DEC_ac_MobileNetworkEndToEndEncryption(c);
            el->g.n = &x->MobileNetworkEndToEndEncryption->gg.g;
            x->MobileNetworkEndToEndEncryption = (struct zx_ac_MobileNetworkEndToEndEncryption_s*)el;
            break;
          case zx_ac_WTLS_ELEM:
            el = (struct zx_elem_s*)zx_DEC_ac_WTLS(c);
            el->g.n = &x->WTLS->gg.g;
            x->WTLS = (struct zx_ac_WTLS_s*)el;
            break;
          case zx_ac_IPSec_ELEM:
            el = (struct zx_elem_s*)zx_DEC_ac_IPSec(c);
            el->g.n = &x->IPSec->gg.g;
            x->IPSec = (struct zx_ac_IPSec_s*)el;
            break;
          case zx_ac_Extension_ELEM:
            el = (struct zx_elem_s*)zx_DEC_ac_Extension(c);
            el->g.n = &x->Extension->gg.g;
            x->Extension = (struct zx_ac_Extension_s*)el;
            break;

	  default:
	    D("known element(%.*s) tok(%d) in wrong context(%d)", c->p - name, name, tok, x->gg.g.tok);
	    tok = ZX_TOK_NOT_FOUND;
	    /* fall thru to classify it as any extension */
	  case ZX_TOK_NOT_FOUND:
	    elem = zx_DEC_wrong_elem(c, name, c->p - name);
	    elem->gg.g.n = &x->gg.any_elem->gg.g;
	    x->gg.any_elem = elem;
	    ZX_UNKNOWN_ELEM_DEC_EXT(elem);
	    break;
	  }
	  goto next_elem;
	}
      }
      /* false alarm <, fall thru */
    }
    /* Data */
    name = c->p;
    ZX_LOOK_FOR(c,'<',x);
    ss = ZX_ZALLOC(c, struct zx_str_s);
    ss->len = c->p - name;
    ss->s = name;
    ss->g.tok = ZX_TOK_DATA;
    ss->g.n = &x->gg.content->g;
    x->gg.content = ss;
    ZX_CONTENT_DEC(ss);
    goto potential_tag;
  }
}

#undef EL_NAME
#undef EL_STRUCT
#undef EL_NS
#undef EL_TAG






/* FUNC(zx_DEC_ac_DeactivationCallCenter) */

#define EL_NAME   ac_DeactivationCallCenter
#define EL_STRUCT zx_ac_DeactivationCallCenter_s
#define EL_NS     ac
#define EL_TAG    DeactivationCallCenter

struct zx_ac_DeactivationCallCenter_s* zx_DEC_ac_DeactivationCallCenter(struct zx_ctx* c)
{
  int tok;
  struct zx_elem_s* el;
  struct zx_str_s* ss;
  struct zx_any_attr_s* attr;
  struct zx_any_elem_s* elem;
  char* name;
  char* data;
  char quote;
  struct zx_ac_DeactivationCallCenter_s* x = ZX_ZALLOC(c, struct zx_ac_DeactivationCallCenter_s);
  x->gg.g.tok = zx_ac_DeactivationCallCenter_ELEM;
  x->gg.g.ns = zx_elems[zx_ac_DeactivationCallCenter_ELEM].ns;
  ZX_START_DEC_EXT(x);

